{
  "architectures": [
    "AlbertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 3,
  "gap_size": 0,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0,
  "hidden_size": 768,
  "id2label": {
    "0": "B-seconds",
    "1": "B-month",
    "2": "I-mid_day",
    "3": "B-week",
    "4": "I-month",
    "5": "I-hour",
    "6": "B-year",
    "7": "B-day",
    "8": "I-second",
    "9": "B-holiday",
    "10": "I-week",
    "11": "O",
    "12": "B-second",
    "13": "I-year",
    "14": "B-half_month",
    "15": "B-minute",
    "16": "B-mid_day",
    "17": "I-holiday",
    "18": "I-seconds",
    "19": "I-half_year",
    "20": "I-day",
    "21": "B-half_year",
    "22": "I-half_month",
    "23": "I-minute",
    "24": "B-hour"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 3072,
  "label2id": {
    "B-day": 7,
    "B-half_month": 14,
    "B-half_year": 21,
    "B-holiday": 9,
    "B-hour": 24,
    "B-mid_day": 16,
    "B-minute": 15,
    "B-month": 1,
    "B-second": 12,
    "B-seconds": 0,
    "B-week": 3,
    "B-year": 6,
    "I-day": 20,
    "I-half_month": 22,
    "I-half_year": 19,
    "I-holiday": 17,
    "I-hour": 5,
    "I-mid_day": 2,
    "I-minute": 23,
    "I-month": 4,
    "I-second": 8,
    "I-seconds": 18,
    "I-week": 10,
    "I-year": 13,
    "O": 11
  },
  "layer_norm_eps": 1e-12,
  "layers_to_keep": [],
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_hidden_groups": 1,
  "num_hidden_layers": 12,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 21128
}
